import { Project } from './project.model';

export const Projects: Project[] =[
    {
        name: "深圳市亿游科技开发有限公司",
        time: "2017.03-2017.05",
        duties: "WEB前端工程师",
        jobName: "微信统一平台",
        content: "微信统一平台项目开发团队一共五人进行协同开发，是华润管理微信群发消息，素材管理，消息回复等功能的后台管理系统。<br>主要负责项目前端开发。<br>负责的内容有编写素材管理模块，消息回复模块开发，采用jquery把模块插件化。与后端开发团队紧密配合，保证代码有效对接，优化前端性能。<br>通过标准检验，使CSS兼容主流浏览器，通过SVN迭代版本配合产品经理实现产品开发。最后通过测试团队测试，并由客户验收，交付给客户优质代码。"
    },

    {
        name: "深圳市亿游科技开发有限公司",
        time: "2017.01-2017.03",
        duties: "WEB前端工程师",
        jobName: "微信商城",
        content: "微信电商是华润万家在微信上的电商平台，涵盖会员中心，卡券核销，会员活动，帮你找店等功能，目标为会员提供微信会员平台，项目团队一共五人协同开发。在项目中主要负责，确定前端框架，并采用JSHINT确保符合规范的前端代码，负责现有项目和新项目的调试和开发。在项目中承担部分模块的设计，实现工作，通过zeplin协同ui对前端页面改进，与产品经理确定产品开发需求。"
    },

    {
        name: "毕业设计",
        time: "2016.11-2017.05",
        duties: "全栈",
        jobName: "微型社交博客",
        content: "微型社交博客是本人毕业设计。采用SSM框架+MAVEN搭建，主要功能是多用户登录，博客发表，博客关注等功能的一个博客网站，并具有网站后台管理，管理员具有对用户，博客，数据字典CRUD操作，前端部分采用HTML5+CSS3技术，上传图片均是上传至阿里云oss，数据库采用mysql。从架构设计，框架搭建，代码实现，数据库设计等都单独完成。"
    },

    {
        name: "在线个人简历",
        time: "2017.05",
        duties: "WEB前端工程师",
        jobName: "",
        content: "个人简历是单独开发的一个基于AngularJs的项目。项目中所使用到的技术有HTML5，CSS3，AngularJS，LESS，NodeJS，WebPack等。项目基本实现PC，手机移动端响应式开发。使用了Anguar cli搭建前端框架，采用了webpack热部署并行开发，结合Karma测试项目运行。Angular的单向数据流确保了当我们的事件处理程序返回并且框架接管渲染结果时，没有什么不可预测的发生。HTML+CSS3+Less让前端页面语义化。"
    }
];